tag-slop.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>tag slop</title>
<meta name="generator" content="Org Mode" />
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
<link rel="apple-touch-icon" sizes="180x180" href="./apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="./favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="./favicon-16x16.png">
<meta property="og:title" content="tag slop">
<meta property="og:description" content="">
<meta property="og:image" content="https://notes.neeasade.net/assets/posts/ca_dump3/d0c9de68b554b413a2e51234d2c89c8a3cf9fd105c06cb54ecc7296e8b3b8356.png">
<meta property="og:url" content="https://notes.neeasade.net/tag-slop">
<meta property="description" content="">
<meta name="twitter:card" content="summary">
<link rel='stylesheet' href='./assets/css/colors.css?sum=cbc7f86dcba5597749ac3221baabf396'>
<link rel='stylesheet' href='./assets/css/normalize.css?sum=112272e51c80ffe5bd01becd2ce7d656'>
<link rel='stylesheet' href='./assets/css/magick.css?sum=2ca97ca19bc03ef9dd1d6b45d109ec3a'>
<link rel='stylesheet' href='./assets/css/notes.css?sum=5146fda5bafcad0a7993df2ca8e83f58'>
</head>
<body>
<main id="content" class="content">
<header>
<div style="float: left">
    <a href='./index.html'>../notes</a>
</div>

<div style="float: right">
    
    
    <a href="https://raw.githubusercontent.com/neeasade/neeasade.github.io/source/posts/tag-slop.org">source</a>
</div>
<h1 class=title>
    <svg viewBox="0 0 40 40" xmlns="http://www.w3.org/2000/svg">
        <rect x="5" y="15" width="20" height="20" fill="none" stroke="#444748" stroke-width="2"/>
        <rect x="14" y="6" width="20" height="20" fill="none" stroke="#444748" stroke-width="2"/>
    </svg>
    tag slop
    <svg viewBox="0 0 40 40" xmlns="http://www.w3.org/2000/svg">
        <rect x="5" y="15" width="20" height="20" fill="none" stroke="#444748" stroke-width="2"/>
        <rect x="14" y="6" width="20" height="20" fill="none" stroke="#444748" stroke-width="2"/>
    </svg>
</h1>
<div class="org-center">
<p>

</p>
</div>
<span class=pubinfo>
    Published 2025-07-25,
    last edit <a href="https://github.com/neeasade/neeasade.github.io/commits/source/posts/tag-slop.org">2025-08-14</a>
</span>
<div class="posttags">  </div>
</header>
<hr>
<p>
I hate tagging content. It occurs to me for a series, but never ahead of time,
and they are nice to have for browsing. Let&rsquo;s add slop to the web by tagging
posts here with <a href="https://ollama.com/">ollama</a>!
</p>

<p>
We can create a model derived from an existing one with a <a href="https://github.com/ollama/ollama/blob/main/docs/modelfile.md">ModelFile</a>:
</p>

<div class="org-src-container">
<pre class="src src-dockerfile"><span style="color: #0065c8;">FROM</span> <span style="color: #006e96; font-weight: bold;">gemma3:12b</span>

<span style="color: #6a6d6e;"># </span><span style="color: #6a6d6e;">setting a seed makes it deterministic</span>
PARAMETER seed 1337

<span style="color: #6a6d6e;"># </span><span style="color: #6a6d6e;">set temperature [higher is more creative, lower is more coherent]</span>
<span style="color: #6a6d6e;"># </span><span style="color: #6a6d6e;">PARAMETER temperature 0.1</span>
PARAMETER temperature 1

<span style="color: #6a6d6e;"># </span><span style="color: #6a6d6e;">allow looking back further, at the cost of more memory</span>
PARAMETER num_ctx 20000
<span style="color: #6a6d6e;"># </span><span style="color: #6a6d6e;">PARAMETER num_ctx 4096</span>

SYSTEM <span style="color: #007c00;">"""You are a content tagger for text. Your will take in an article and return a terse set of tags.</span>

<span style="color: #007c00;">A tag is a single word.</span>
<span style="color: #007c00;">Tags should not be plural.</span>
<span style="color: #007c00;">Tags should be relevant to the article contents.</span>

<span style="color: #007c00;">Only respond with a single line comma-separated list of tags, such as:</span>
<span style="color: #007c00;">emacs,bspwm,colors,music,hallucination</span>
<span style="color: #007c00;">"""</span>

<span style="color: #6a6d6e;"># </span><span style="color: #6a6d6e;">give it an example of expected conversation:</span>
MESSAGE user tag this text: Cake is nice. I love cats and lately I<span style="color: #007c00;">'ve been thinking about the rain</span>
<span style="color: #007c00;">MESSAGE assistant cake,cats,rain</span>
</pre>
</div>

<p>
We&rsquo;ll name it &ldquo;tagger&rdquo;:
</p>

<div class="org-src-container">
<pre class="src src-sh">ollama create tagger -f ../extra/modelfile.txt;
</pre>
</div>

<p>
And we&rsquo;re off!:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ cat On-Emacs.org | ollama run tagger <span style="color: #007c00;">"tag the following content: \n"</span>
emacs,programming,text-editor,lisp,customization
</pre>
</div>

<p>
I&rsquo;m not much of a prompt engineer, but it&rsquo;s been fun (and infuriating) to see
how little shifts in the system prompt affect the quality of the tagging.
</p>

<div class=separator> ∗ ∗ ∗ </div>

<p>
Much more interesting has been HOWTO display the tags around the site. Showing
generated tags on every header would get noisy fast - I&rsquo;ve decided that what
makes tags meaningful is there being multiple posts with a tag (it&rsquo;s annoying to
click a tag link and find out you are on the only relevant post already). You
can see the tag cloud over at <a href="./tags.html">tag links</a>, but for now only tags that have
multiple posts are shown at the top of post pages.
</p>

<footer>
    <div style="float: left">
         <a href='cool-stuff.html'>newer: cool stuff</a> 
    </div>
    <div style="text-align: right">
         <a href='dokku.html'>older: dokku</a> 
    </div>
</footer>
<hr>
</main>
</body>
</html>
